In [1]:
# Dependencies and Setup
import pandas as pd
from pathlib import Path

In [2]:
# Store files as a variables
file_ct = Path("Resources/MDSTHPI.csv")
file_md = Path("Resources/CTSTHPI.csv")
file_tx = Path("Resources/TXSTHPI.csv")
file_wa = Path("Resources/WASTHPI.csv")
file_us = Path("Resources/USSTHPI.csv")

In [3]:
# Read .csv files
file_ct_df = pd.read_csv(file_md)
file_md_df = pd.read_csv(file_ct)
file_tx_df = pd.read_csv(file_tx)
file_wa_df = pd.read_csv(file_wa)
file_us_df = pd.read_csv(file_us)

In [4]:
# Converting Date datatype
# Source for converting date datatype: https://medium.com/analytics-vidhya/how-to-pd-merge-two-data-frames-on-a-common-date-column-e7808d7ccaee
file_ct_df['DATE'] = pd.to_datetime(file_md_df.DATE)
file_md_df['DATE'] = pd.to_datetime(file_ct_df.DATE)
file_tx_df['DATE'] = pd.to_datetime(file_tx_df.DATE)
file_wa_df['DATE'] = pd.to_datetime(file_wa_df.DATE)
file_us_df['DATE'] = pd.to_datetime(file_us_df.DATE)

In [5]:
# Checking the file_us_df DATE format
file_us_df.info

<bound method DataFrame.info of           DATE  USSTHPI
0   1975-01-01    60.07
1   1975-04-01    61.01
2   1975-07-01    61.20
3   1975-10-01    62.24
4   1976-01-01    62.89
..         ...      ...
188 2022-01-01   578.71
189 2022-04-01   617.95
190 2022-07-01   628.40
191 2022-10-01   623.26
192 2023-01-01   625.38

[193 rows x 2 columns]>

In [6]:
# Reset indices for dataframes
file_ct_df.reset_index()
file_md_df.reset_index()
file_tx_df.reset_index()
file_wa_df.reset_index()
file_us_df.reset_index()

     index       DATE  USSTHPI
0        0 1975-01-01    60.07
1        1 1975-04-01    61.01
2        2 1975-07-01    61.20
3        3 1975-10-01    62.24
4        4 1976-01-01    62.89
..     ...        ...      ...
188    188 2022-01-01   578.71
189    189 2022-04-01   617.95
190    190 2022-07-01   628.40
191    191 2022-10-01   623.26
192    192 2023-01-01   625.38

[193 rows x 3 columns]

In [7]:
# Checking the file_us_df type
type(file_us_df)

pandas.core.frame.DataFrame

In [8]:
# Concatenate all state & US dataframes
combined_hpi = pd.concat([file_ct_df[["DATE","CTSTHPI"]], file_md_df["MDSTHPI"], file_tx_df["TXSTHPI"], file_wa_df["WASTHPI"], file_us_df["USSTHPI"]], axis = 1)

In [9]:
# Display first 5 concatenated states & US dataframes
combined_hpi.head()

        DATE  CTSTHPI  MDSTHPI  TXSTHPI  WASTHPI  USSTHPI
0 1975-01-01    62.28    61.89    55.63    46.26    60.07
1 1975-04-01    62.82    62.35    58.60    47.18    61.01
2 1975-07-01    61.86    65.13    56.16    49.72    61.20
3 1975-10-01    61.88    67.04    59.34    48.05    62.24
4 1976-01-01    64.80    67.35    58.65    50.36    62.89

In [10]:
# Display last 5 concatenated states & US dataframes
combined_hpi.tail()

          DATE  CTSTHPI  MDSTHPI  TXSTHPI  WASTHPI  USSTHPI
188 2022-01-01   522.84   599.85   459.73   911.13   578.71
189 2022-04-01   555.63   628.90   493.63   975.15   617.95
190 2022-07-01   566.25   630.36   503.83   966.46   628.40
191 2022-10-01   564.56   628.93   500.08   938.28   623.26
192 2023-01-01   569.09   631.33   499.26   934.99   625.38

In [11]:
# Verify count of rows in combined dataframe is equal to rows in .csv file less header
combined_hpi.value_counts()

DATE        CTSTHPI  MDSTHPI  TXSTHPI  WASTHPI  USSTHPI
1975-01-01  62.28    61.89    55.63    46.26    60.07      1
1999-04-01  248.78   229.34   152.27   259.90   220.42     1
2005-10-01  456.51   494.71   202.72   429.38   362.92     1
2006-01-01  462.44   508.39   205.12   444.75   368.68     1
2006-04-01  464.77   518.83   208.35   460.08   372.46     1
                                                          ..
1991-10-01  236.05   209.78   121.08   188.17   171.49     1
1992-01-01  237.06   210.55   123.05   189.06   172.81     1
1992-04-01  232.39   209.19   122.61   190.81   172.77     1
1992-07-01  233.22   211.15   124.68   193.37   174.74     1
2023-01-01  569.09   631.33   499.26   934.99   625.38     1
Length: 193, dtype: int64

In [12]:
# Write file to .csv
#Source for writing file to .csv: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html
filepath = Path("Resources/combined_hpi.csv")
filepath.parent.mkdir(parents=True, exist_ok=True)
combined_hpi.to_csv(filepath)